<a href="https://colab.research.google.com/github/Santanukolkata/Data_Science/blob/master/Pandas/Panda_crosstab_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/Santanukolkata/Data_Science/master/datasets/titanic-test.csv')

In [3]:
df.shape

(418, 11)

In [4]:
df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [6]:
pd.crosstab(df['Pclass'],df['Sex'],margins=True)

Sex     female  male  All
Pclass
1           50    57  107
2           30    63   93
3           72   146  218
All        152   266  418

In [7]:
df_summ=pd.DataFrame(pd.crosstab(df['Pclass'],df['Sex'],margins=True))

In [9]:
df_summ.columns

Index(['female', 'male', 'All'], dtype='object', name='Sex')

In [12]:
def bucketing(x):
    if x <=20:
        return "less then 20"
    elif (x > 20 and x <= 40 ):
        return "less then 40"
    elif (x > 40 and x <= 60 ):
        return "less then 60"
    elif (x > 60 and x <= 80 ):
        return "less then 80"
    else:
        return "older"
df['age_group']=df['Age'].apply(lambda x:bucketing(x))

In [14]:
pd.crosstab([df['Pclass'],df['Sex']],df['age_group'],margins=True)

age_group      less then 20  less then 40  ...  older  All
Pclass Sex                                 ...
1      female             2            22  ...      2   50
       male               3            18  ...      7   57
2      female            11            15  ...      1   30
       male               9            37  ...      4   63
3      female            19            28  ...     22   72
       male              25            66  ...     50  146
All                      69           186  ...     86  418

[7 rows x 6 columns]